IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/MCSPI0_MCSPI0.xml
	<register id="MCSPI0_WAKEUPENABLE" acronym="MCSPI0_WAKEUPENABLE" offset="0x120" width="32" description="">
		<bitfield id="RESERVED" width="31" begin="31" end="1" resetval="0x0" description="Reads returns 0" range="31 - 1" rwaccess="RO"/> 
		<bitfield id="WKEN" width="1" begin="0" end="0" resetval="0x0" description="WakeUp functionality in slave mode when an active control signal is detected on the SPIEN line programmed in the field MCSPI_CH0CONF[SPIENSLV]" range="0" rwaccess="RW"/>
	</register>
	<register id="MCSPI0_SYST" acronym="MCSPI0_SYST" offset="0x124" width="32" description="">
		<bitfield id="RESERVED" width="20" begin="31" end="12" resetval="0x0" description="Reads returns 0" range="31 - 12" rwaccess="RO"/> 
		<bitfield id="SSB" width="1" begin="11" end="11" resetval="0x0" description="Set status bit" range="11" rwaccess="RW"/> 
		<bitfield id="SPIENDIR" width="1" begin="10" end="10" resetval="0x0" description="Set the direction of the SPIEN[3:0] lines and SPICLK line" range="10" rwaccess="RW"/> 
		<bitfield id="SPIDATDIR1" width="1" begin="9" end="9" resetval="0x0" description="Set the direction of the SPIDAT[1]" range="9" rwaccess="RW"/> 
		<bitfield id="SPIDATDIR0" width="1" begin="8" end="8" resetval="0x0" description="Set the direction of the SPIDAT[0]" range="8" rwaccess="RW"/> 
		<bitfield id="WAKD" width="1" begin="7" end="7" resetval="0x0" description="SWAKEUP output [signal data value of internal signal to system] The signal is driven high or low according to the value written into this register bit" range="7" rwaccess="RW"/> 
		<bitfield id="SPICLK" width="1" begin="6" end="6" resetval="0x0" description="SPICLK line [signal data value] If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the CLKSPI line [high or low], and a write into this bit has no effect If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the CLKSPI line is driven high or low according to the value written into this register" range="6" rwaccess="RW"/> 
		<bitfield id="SPIDAT_1" width="1" begin="5" end="5" resetval="0x0" description="SPIDAT[1] line [signal data value] If MCSPI_SYST[SPIDATDIR1] = 0 [output mode direction], the SPIDAT[1] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIDATDIR1] = 1 [input mode direction], this bit returns the value on the SPIDAT[1] line [high or low], and a write into this bit has no effect" range="5" rwaccess="RW"/> 
		<bitfield id="SPIDAT_0" width="1" begin="4" end="4" resetval="0x0" description="SPIDAT[0] line [signal data value] If MCSPI_SYST[SPIDATDIR0] = 0 [output mode direction], the SPIDAT[0] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIDATDIR0] = 1 [input mode direction], this bit returns the value on the SPIDAT[0] line [high or low], and a write into this bit has no effect" range="4" rwaccess="RW"/> 
		<bitfield id="SPIEN_3" width="1" begin="3" end="3" resetval="0x0" description="SPIEN[3] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[3] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[3] line [high or low], and a write into this bit has no effect" range="3" rwaccess="RW"/> 
		<bitfield id="SPIEN_2" width="1" begin="2" end="2" resetval="0x0" description="SPIEN[2] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[2] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[2] line [high or low], and a write into this bit has no effect" range="2" rwaccess="RW"/> 
		<bitfield id="SPIEN_1" width="1" begin="1" end="1" resetval="0x0" description="SPIEN[1] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[1] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[1] line [high or low], and a write into this bit has no effect" range="1" rwaccess="RW"/> 
		<bitfield id="SPIEN_0" width="1" begin="0" end="0" resetval="0x0" description="SPIEN[0] line [signal data value] If MCSPI_SYST[SPIENDIR] = 0 [output mode direction], the SPIENT[0] line is driven high or low according to the value written into this register If MCSPI_SYST[SPIENDIR] = 1 [input mode direction], this bit returns the value on the SPIEN[0] line [high or low], and a write into this bit has no effect" range="0" rwaccess="RW"/>
	</register>
	<register id="MCSPI0_MODULCTRL" acronym="MCSPI0_MODULCTRL" offset="0x128" width="32" description="">
		<bitfield id="RESERVED" width="23" begin="31" end="9" resetval="0x0" description="Reads returns 0" range="31 - 9" rwaccess="RO"/> 
		<bitfield id="FDAA" width="1" begin="8" end="8" resetval="0x0" description="FIFO DMA Address 256-bit aligned This register is used when a FIFO is managed by the module and DMA connected to the controller provides only 256 bit aligned address If this bit is set the enabled channel which uses the FIFO has its datas managed through MCSPI_DAFTX and MCSPI_DAFRX registers instead of MCSPI_TX[i] and MCSPI_RX[i] registers" range="8" rwaccess="RW"/> 
		<bitfield id="MOA" width="1" begin="7" end="7" resetval="0x0" description="Multiple word ocp access: This register can only be used when a channel is enabled using a FIFO It allows the system to perform multiple SPI word access for a single 32-bit OCP word access This is possible for WL &#60; 16" range="7" rwaccess="RW"/> 
		<bitfield id="INITDLY" width="3" begin="6" end="4" resetval="0x0" description="Initial spi delay for first transfer: This register is an option only available in SINGLE master mode, The controller waits for a delay to transmit the first spi word after channel enabled and corresponding TX register filled This Delay is based on SPI output frequency clock, No clock output provided to the boundary and chip select is not active in 4 pin mode within this period" range="6 - 4" rwaccess="RW"/> 
		<bitfield id="SYSTEM_TEST" width="1" begin="3" end="3" resetval="0x0" description="Enables the system test mode" range="3" rwaccess="RW"/> 
		<bitfield id="MS" width="1" begin="2" end="2" resetval="0x1" description="Master/ Slave" range="2" rwaccess="RW"/> 
		<bitfield id="PIN34" width="1" begin="1" end="1" resetval="0x0" description="Pin mode selection: This register is used to configure the SPI pin mode, in master or slave mode If asserted the controller only use SIMO,SOMI and SPICLK clock pin for spi transfers" range="1" rwaccess="RW"/> 
		<bitfield id="SINGLE" width="1" begin="0" end="0" resetval="0x0" description="Single channel / Multi Channel [master mode only]" range="0" rwaccess="RW"/>
	</register>
